{"Bas-Saint-Laurent-Gaspésie-Îles-de-la-Madeleine": ["A-2 closed, New Brunswick, in Oromocto area. Indetermined period. Cause: Flooding.", "R-132 closed at Cascapédia - Saint-Jules,  WESTBOUND and EASTBOUND, at the height of Cascapédia River. Reopening on June 2018.\r\n\r\nDetour of about 11 km : routes MacKay and des Ponts and R-299 at km 5. Follow traffic sign on site. Reason: Broken structure. For vehicles over 3.5 meters wide, contact Centre de services of New Carlisle for the  alternate route.", "Île d'Entrée - Cap-aux-Meules. Services : Closed.", "Closure R-234 at height cours d'eau Saint-Amand, WESTBOUND and EASTBOUND, Sainte-Angèle-de-Mérici, undetermined period. Reason : Flooding.", "Closure R-299 between km 10 and km 18, SOUTHBOUND and NORTHBOUND, Cascapédia - Saint-Jules, undetermined period. Reason : Broken structure.", "Alternating traffic 4e Rang Ouest at height rivière Gamache, WESTBOUND and EASTBOUND, Saint-Valérien, undetermined period. Reason : Pavement failure.", "Closure ROUTE HEPPEL (PONT) between Rang Ferdinand-Heppell Sud and R-132, SOUTHBOUND and NORTHBOUND, Causapscal, undetermined period. Reason : Broken structure.", "Closure Route de Patrickton between Chemin Sexton and Route Droken, SOUTHBOUND and NORTHBOUND, Cascapédia - Saint-Jules, undetermined period. Reason : Broken structure."], "Côte-Nord": ["1 lane closed out of 2 rue principale at height chemin Principal, WESTBOUND, Pointe-aux-Outardes, undetermined period. Reason : Pavement failure."], "Estrie": ["Alternating traffic R-204 at the boundaries of Saint-Gédéon-de-Beauce, EASTBOUND, Saint-Ludger, undetermined period. Reason : Road failure.", "Closure R-255 at height chemin Martin-Grenier, SOUTHBOUND and NORTHBOUND, Dudswell, undetermined period. Reason : Incident.", "Alternating traffic chemin de fontainebleau between chemin Savage and chemin Fontaine, SOUTHBOUND and NORTHBOUND, Weedon, undetermined period, detour on local network. Reason : Flooding."], "Laurentides-Lanaudière": ["Slow-moving traffic R-117 at height km 148, SOUTHBOUND and NORTHBOUND, Labelle, undetermined period. Reason : Bumps in the pavement.", "1 lane closed out of 2 R-117 at height rue Brunet, SOUTHBOUND, Mont-Laurier, undetermined period. Reason : Road failure.", "Closure R-131 between rue Saint-Michel and rue Chagnon, SOUTHBOUND and NORTHBOUND, Saint-Michel-des-Saints, undetermined period. Reason : Flooding.", "Closure R-321 at the Mullen Bridge, SOUTHBOUND and NORTHBOUND, Rivière-Rouge, undetermined period. Reason : Flooding.", "Closure R-347 at height chemin des Loisirs, SOUTHBOUND and NORTHBOUND, Saint-Damien, undetermined period, detour on local network. Reason : Flooding.", "Closure 2e rang de Moreau at height ruisseau Gorman, WESTBOUND and EASTBOUND, Ferme-Neuve, undetermined period, detour on local network. Reason : Road failure.", "Closure route de la ferme at height rue du Lac-Froid, WESTBOUND and EASTBOUND, Secteur Saint-Guillaume-Nord, undetermined period. Reason : Flooding.", "Closure Chemin de Château-Bleu between rue Trudeau and rue Brissette, SOUTHBOUND and NORTHBOUND, Sainte-Agathe-des-Monts, undetermined period. Reason : Inspection.", "Closure CHEMIN DU PONT PRUD'HOMME The Prud'homme Bridge, WESTBOUND and EASTBOUND, Brébeuf, undetermined period. Reason : Flooding.", "Closure Rang Saint-Augustin between 2e Avenue and rang Saint-Louis, SOUTHBOUND and NORTHBOUND, Mandeville, undetermined period, detour on local network. Reason : Flooding.", "Closure Chemin Lafrenière between chemin England and R-347, WESTBOUND and EASTBOUND, Saint-Damien, undetermined period, detour on local network. Reason : Water accumulation."], "Mauricie-Centre-du-Québec": ["Closure R-349 at height rivière du Loup, SOUTHBOUND and NORTHBOUND, Saint-Paulin, undetermined period, detour Détour pour les véhicules légers, camions lourds permis. Reason : Flooding.", "Closure of route de la Promenade, La Mauricie National Park, between Saint-Jean-des-Piles and Saint-Mathieu-du-Parc. Cause: Winter season.", "Closure Rang des Pins-Rouges Between km 10 and 11, SOUTHBOUND and NORTHBOUND, Saint-Alexis-des-Monts, undetermined period, detour Permis aux camions lourds seulement - Aucun détour. Reason : Flooding."], "Montérégie": ["Alternating traffic R-205 between rue des Tilleuls and rue Phénix, SOUTHBOUND and NORTHBOUND, Sainte-Martine, undetermined period. Reason : Road failure.", "Closure Rue Provost between 2e Rang and 1e Rang, SOUTHBOUND and NORTHBOUND, Acton Vale, undetermined period, detour on local network. Reason : Broken structure."], "Outaouais": ["1 lane closed out of 2 R-321 at height rue de l'Hôtel-de-Ville, SOUTHBOUND, Saint-André-Avellin, undetermined period. Reason : Flooding.", "Alternating traffic Chemin Eardley-Masham between La Pêche and Pontiac, SOUTHBOUND and NORTHBOUND, undetermined period. Reason : Road failure.", "Alternating traffic Chemin Thomas Sud at height chemin Chomedey, WESTBOUND and EASTBOUND, Notre-Dame-de-la-Salette, undetermined period. Reason : Erosion."], "Québec (Capitale-Nationale)": ["1 lane closed out of 2 A-40 at height km 274, EASTBOUND, Donnacona, undetermined period. Reason : Roadway departure.", "Truck traffic prohibited R-138 between chemin de la Passe-Migratoire and rue Pépin, WESTBOUND and EASTBOUND, Donnacona, undetermined period, detour EST: A-40, sortie 274 (Donnacona)\r\nOUEST: A-40, sortie 269 (Cap-Santé). Reason : Erosion."]}
